[
  {
    "code": "B01",
    "term": "Testing of Actual/Suspected Device",
    "definition": "The investigation employed relevant empirical testing of the actual device suspected in the reported adverse event in order to establish their functional and other properties and to identify possible causes for the adverse event. Relevant testing would typically be based on test methods used for evaluating safety and performance as described in the latest relevant standards.",
    "Non-IMDRF Code/Term": "",
    "Status": "",
    "Status Description": "",
    "codehierarchy": "B01"
  },
  {
    "code": "B02",
    "term": "Testing of Device from Same Lot/Batch Retained by Manufacturer",
    "definition": "The investigation employed relevant empirical testing of the device of the same lot or batch than that of the suspected device in the reported adverse event in order to support the identification of possible causes for the adverse event. Testing was performed using the device retained by the manufacturer (i.e. was not shipped). Relevant testing would typically be based on test methods used for evaluating safety and performance as described in the latest relevant standards.",
    "Non-IMDRF Code/Term": "",
    "Status": "",
    "Status Description": "",
    "codehierarchy": "B02"
  },
  {
    "code": "B03",
    "term": "Testing of Device from Same Lot/Batch Returned from User",
    "definition": "The investigation employed relevant empirical testing of the device of the same lot or batch than that of the suspected device in the reported adverse event in order to support the identification of possible causes for the adverse event. The device was returned from the user. Relevant testing would typically be based on test methods used for evaluating safety and performance as described in the latest relevant standards.",
    "Non-IMDRF Code/Term": "",
    "Status": "",
    "Status Description": "",
    "codehierarchy": "B03"
  },
  {
    "code": "B04",
    "term": "Testing of Device from Other Lot/Batch Retained by Manufacturer",
    "definition": "The investigation employed relevant empirical testing of the device of another lot or batch than that of the suspected device in the reported adverse event in order to support the identification of possible causes for the adverse event. This includes devices without a lot/batch designation. Testing was performed using the device retained by the manufacturer (i.e. was not shipped). Relevant testing would typically be based on test methods used for evaluating safety and performance as described in the latest relevant standards.",
    "Non-IMDRF Code/Term": "",
    "Status": "",
    "Status Description": "",
    "codehierarchy": "B04"
  },
  {
    "code": "B05",
    "term": "Testing of Device from Other Lot/Batch Returned From User",
    "definition": "The investigation employed relevant empirical testing of the device of another lot or batch than that of the suspected device in the reported adverse event in order to support the identification of possible causes for the adverse event. This includes devices without a lot/batch designation. The device was returned from the user. Relevant testing would typically be based on test methods used for evaluating safety and performance as described in the technical file. Relevant testing would typically be based on test methods used for evaluating safety and performance as described in the latest relevant standards.",
    "Non-IMDRF Code/Term": "",
    "Status": "",
    "Status Description": "",
    "codehierarchy": "B05"
  },
  {
    "code": "B06",
    "term": "Testing of Model Variant",
    "definition": "The investigation employed relevant empirical testing of a model variant of the device involved in the reported adverse event in order to support the identification of possible causes for the adverse event through plausibility reasoning. A model variant is not identical to the actual device, but shares relevant characteristics with the device involved. Relevant testing would typically be based on test methods used for evaluating safety and performance as described in the latest relevant standards.",
    "Non-IMDRF Code/Term": "",
    "Status": "",
    "Status Description": "",
    "codehierarchy": "B06"
  },
  {
    "code": "B07",
    "term": "Testing of Raw/Starting Materials",
    "definition": "The investigation employed relevant empirical testing of the materials used in construction of the device involved in the reported adverse event in order to support the identification of possible causes for the adverse event. Relevant testing would typically be based on test methods used for evaluating safety and performance as described in the latest relevant standards.",
    "Non-IMDRF Code/Term": "",
    "Status": "",
    "Status Description": "",
    "codehierarchy": "B07"
  },
  {
    "code": "B08",
    "term": "Testing of Patient Sample or Reference Material Using Manufacturer's Device",
    "definition": "The investigation employed relevant empirical testing of a patient sample or reference material using the device (usually an IVD) involved in the reported adverse event in order to support the identification of possible causes for the adverse event. Relevant testing would typically be based on test methods used for evaluating safety and performance as described in the latest relevant standards.",
    "Non-IMDRF Code/Term": "",
    "Status": "",
    "Status Description": "",
    "codehierarchy": "B08"
  },
  {
    "code": "B09",
    "term": "Testing of Patient Sample or Reference Material Using Reference Method",
    "definition": "The investigation employed relevant empirical testing of a patient sample or reference material using an appropriate reference method to the device (usually an IVD) involved in the reported adverse event in order to support the identification of possible causes for the adverse event. Relevant testing would typically be based on test methods used for evaluating safety and performance as described in the latest relevant standards.",
    "Non-IMDRF Code/Term": "",
    "Status": "",
    "Status Description": "",
    "codehierarchy": "B09"
  },
  {
    "code": "B10",
    "term": "Testing of Patient Sample or Reference Material Using Competitor's Device",
    "definition": "The investigation employed relevant empirical testing of a patient sample or reference material using a competitor's device that is comparable to the device (usually an IVD) involved in the reported adverse event in order to support the identification of possible causes for the adverse event. Relevant testing would typically be based on test methods used for evaluating safety and performance as described in the latest relevant standards.",
    "Non-IMDRF Code/Term": "",
    "Status": "",
    "Status Description": "",
    "codehierarchy": "B10"
  },
  {
    "code": "B11",
    "term": "Historical Data Analysis",
    "definition": "The investigation involved the analysis of historical adverse events data of the actual device involved in the adverse event and/or of products from the same and/or different batches/lots.",
    "Non-IMDRF Code/Term": "",
    "Status": "",
    "Status Description": "",
    "codehierarchy": "B11"
  },
  {
    "code": "B12",
    "term": "Trend Analysis",
    "definition": "The investigation involved trend analysis of adverse event of the actual device involved in the adverse event and/or of products from the same and/or different batches/lots. It should be noted that trend analysis typically is not considered sufficient as a stand-alone method, but should be used in conjunction with other investigation methods for providing for instance complementary information.",
    "Non-IMDRF Code/Term": "",
    "Status": "",
    "Status Description": "",
    "codehierarchy": "B12"
  },
  {
    "code": "B13",
    "term": "Communication/Interviews",
    "definition": "The investigation involved communication/interviews (either interpersonal or through technical means, e.g. phone, e-mail) with persons close to the adverse event, e.g. healthcare professionals (doctors, nurses etc.), the affected patient(s) or other users including, where appropriate, relatives or others engaged in caring for the affected patient.",
    "Non-IMDRF Code/Term": "",
    "Status": "",
    "Status Description": "",
    "codehierarchy": "B13"
  },
  {
    "code": "B14",
    "term": "Analysis of Production Records",
    "definition": "The investigation involved the analysis of relevant production records in view of supporting the identification of possible causes for the adverse event.",
    "Non-IMDRF Code/Term": "",
    "Status": "",
    "Status Description": "",
    "codehierarchy": "B14"
  },
  {
    "code": "B15",
    "term": "Analysis of Data Provided by User/Third Party",
    "definition": "The investigation involved the analysis of relevant data provided by the user (e.g. healthcare professional, patient, clinical engineer) or a third party (e.g. testing facility) in view of supporting the identification of possible causes for the adverse event.",
    "Non-IMDRF Code/Term": "",
    "Status": "",
    "Status Description": "",
    "codehierarchy": "B15"
  },
  {
    "code": "B16",
    "term": "Device Not Manufactured by Reporting Manufacturer",
    "definition": "Further information was obtained which established that the manufacturer of the device involved was not the one to which it was initially attributed. Use in conjunction with C20 and D14.",
    "Non-IMDRF Code/Term": "",
    "Status": "Modified (technical)",
    "Status Description": "Definition was modified on 21 January 2021 (addition of phrase \"Use in conjunction with C20 and D14.\"). For details, refer to comment No. 18 of the Change Log.",
    "codehierarchy": "B16"
  },
  {
    "code": "B17",
    "term": "Device Not Returned",
    "definition": "The actual device involved in the adverse event was not returned for testing despite requests by manufacturer.",
    "Non-IMDRF Code/Term": "",
    "Status": "",
    "Status Description": "",
    "codehierarchy": "B17"
  },
  {
    "code": "B18",
    "term": "Device Discarded",
    "definition": "The actual device involved in the adverse event had been already discarded and thus irretrievably lost for testing.",
    "Non-IMDRF Code/Term": "",
    "Status": "",
    "Status Description": "",
    "codehierarchy": "B18"
  },
  {
    "code": "B19",
    "term": "Incomplete Device Returned",
    "definition": "The device was returned incompletely, lacking parts, components or accessories that would be required for appropriate testing and analysis of root causes.",
    "Non-IMDRF Code/Term": "",
    "Status": "",
    "Status Description": "",
    "codehierarchy": "B19"
  },
  {
    "code": "B20",
    "term": "Device Not Accessible for Testing",
    "definition": "The actual device involved in the adverse event is not readily accessible for testing (e.g. remains implanted in patient).",
    "Non-IMDRF Code/Term": "",
    "Status": "",
    "Status Description": "",
    "codehierarchy": "B20"
  },
  {
    "code": "B21",
    "term": "Type of Investigation Not Yet Determined",
    "definition": "Details to determine the type of investigation are not yet available, but are being sought. Do not use this code if the investigation is complete.",
    "Non-IMDRF Code/Term": "",
    "Status": "",
    "Status Description": "",
    "codehierarchy": "B21"
  },
  {
    "code": "B22",
    "term": "Insufficient Information Available",
    "definition": "The information available relating to the reported event is not sufficient to identify either the manufacturer, the device, or other essential information. This term indicates that no further investigation is possible. Do not use this code if further information is being sought, instead use ''Type of investigation not yet determined''.",
    "Non-IMDRF Code/Term": "",
    "Status": "",
    "Status Description": "",
    "codehierarchy": "B22"
  },
  {
    "code": "B23",
    "term": "Specimen Requested But Not Provided",
    "definition": "A patient specimen was required to adequately investigate the issue and was requested but not provided.",
    "Non-IMDRF Code/Term": "",
    "Status": "New",
    "Status Description": "Term was added on 21 January 2021. For details, refer to comment No. 22 of the Change Log.",
    "codehierarchy": "B23"
  }
]